# pandas级联操作

  pandas的拼接分为两种：
  - 级联：pd.concat，pd.append
  - 合并：pd.merge，pd.join

In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [6]:
#numpy级联维度上的形状要保持一致
arr1 = np.ones(shape=(2,2))
arr2 = np.zeros(shape=(3,2))

In [7]:
arr1

array([[1., 1.],
       [1., 1.]])

In [8]:
arr2

array([[0., 0.],
       [0., 0.],
       [0., 0.]])

In [12]:
# np.concatenate((arr1,arr2),axis=1)报错
np.concatenate((arr1,arr2),axis=0)

array([[1., 1.],
       [1., 1.],
       [0., 0.],
       [0., 0.],
       [0., 0.]])

## 1.使用pd.concat()级联
   
    - 级联方向上的形状不同，同样可以连接
    - 以索引对齐的方式进行连接，所以跟顺序没有关系
    - 通过设置axis来改变级联方向，优先增加行数（默认axis=0）

In [15]:
df_1 = DataFrame(data=np.random.randint(0,100,size=(3,3)),columns=['python','java','php'],index=list("ABC"))
df_2 = DataFrame(data=np.random.randint(0,100,size=(4,3)),columns=['java','python','php'],index=list("DEFG"))
display(df_1,df_2)

   python  java  php
A      92    14   76
B      48    42   24
C      72     2   88

   java  python  php
D    92      60   98
E    99      47   30
F    99      42   57
G    53      40   70

In [16]:
pd.concat(objs=(df_1,df_2),)

   python  java  php
A      92    14   76
B      48    42   24
C      72     2   88
D      60    92   98
E      47    99   30
F      42    99   57
G      40    53   70

ignore_index=True参数别乱用，只有索引没有实际意义时可使用，可用key=['x','y']做成多层级索引。

In [18]:
df_3 = df_1.append(df_2)b

C:\Windows\Temp\ipykernel_10968\2990379657.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_3 = df_1.append(df_2)

In [19]:
df_1

   python  java  php
A      92    14   76
B      48    42   24
C      72     2   88

In [20]:
df_3

   python  java  php
A      92    14   76
B      48    42   24
C      72     2   88
D      60    92   98
E      47    99   30
F      42    99   57
G      40    53   70